ezois_ka/oooezoiskaobmen/src/InformationRegisters/ПорядокОтраженияНаСчетахУчета/ПорядокОтраженияНаСчетахУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокОтраженияНаСчетахУчета</name>
  <resources>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>Субконто</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>ОтноситсяКМалоценнымТМЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчета</name>
    <type>
      <types>DefinedType.НастройкаСчетовУчетаАналитикаУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоУчета</name>
    <type>
      <types>DefinedType.НастройкаСчетовУчетаМестоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСчета</name>
    <type>
      <types>EnumRef.ВидыСчетовРеглУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Долгосрочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/Catalogs/НастройкиСчетовУчетаПрочихОпераций/НастройкиСчетовУчетаПрочихОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиСчетовУчетаПрочихОпераций</name>
  <comment>Настройки счетов учета прочих операций</comment>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецНастройки</name>
    <type>
      <types>DocumentRef.ВнутреннееПотребление</types>
      <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
      <types>DocumentRef.ЗаписьКнигиПокупок</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеУслугПоАренде</types>
      <types>DocumentRef.Бронирование</types>
      <types>DocumentRef.НачислениеОценочныхОбязательствПоОтпускам</types>
      <types>DocumentRef.СписаниеОС2_4</types>
      <types>DocumentRef.РаспределениеПроизводственныхЗатрат</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.АктПремииКлиенту</types>
      <types>DocumentRef.ВозвратОСИзАренды2_4</types>
      <types>DocumentRef.АктВыполненныхВнутреннихРабот</types>
      <types>DocumentRef.ПрочиеДоходыРасходы</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.ПеремещениеОС2_4</types>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
      <types>DocumentRef.РаспределениеПрочихЗатрат</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
      <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете</types>
      <types>DocumentRef.КорректировкаЗадолженностиПоФинансовымИнструментам</types>
      <types>DocumentRef.ВыбытиеДенежныхДокументов</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПринятиеКУчетуНМА2_4</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ПеремещениеНМА2_4</types>
      <types>DocumentRef.АмортизацияНМА2_4</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.СписаниеНМА2_4</types>
      <types>DocumentRef.РаспределениеВозвратныхОтходов</types>
      <types>DocumentRef.ПринятиеКУчетуОС2_4</types>
      <types>DocumentRef.КорректировкаСтоимостиИАмортизацииОС</types>
      <types>DocumentRef.КорректировкаЗадолженности</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.ОтчетОСписанииТоваровСХранения</types>
      <types>DocumentRef.ОтчетОСписанииТоваровУХранителя</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
      <types>DocumentRef.АмортизацияОС2_4</types>
      <types>DocumentRef.ПринятиеКУчетуУзловКомпонентовАмортизации</types>
      <types>DocumentRef.ВзаимозачетЗадолженности</types>
      <types>DocumentRef.ДепонированиеЗарплаты</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.НачисленияКредитовИДепозитов</types>
      <types>DocumentRef.КорректировкаСтоимостиИАмортизацииНМА</types>
      <types>DocumentRef.ЗаписьКнигиПродаж</types>
      <types>DocumentRef.ОтчетПереработчика2_5</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете2_5</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиМеждународногоУчета</name>
    <attributes>
      <name>ПланСчетов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ezois_ka/oooezoiskaobmen/src/CommonModules/НастройкаСчетовУчетаСлужебныйВызовСервера/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

//++ Локализация

Функция СсылкаНастройкаСчетовУчета(ОбъектНастройки, РазделУчета = Неопределено) Экспорт
	
	ТекстГиперссылки = НСтр("ru = 'Настроить счета учета%Детализация%'");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПорядокОтраженияНаСчетахУчета.Организация КАК Организация,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПорядокОтраженияНаСчетахУчета.МестоУчета) КАК КоличествоНастроек
	|ИЗ
	|	РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК ПорядокОтраженияНаСчетахУчета
	|ГДЕ
	|	ПорядокОтраженияНаСчетахУчета.АналитикаУчета = &ОбъектНастройки
	|	И ПорядокОтраженияНаСчетахУчета.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПорядокОтраженияНаСчетахУчета.Организация
	|ИТОГИ
	|	СУММА(КоличествоНастроек)
	|ПО
	|	ОБЩИЕ";
	Запрос.УстановитьПараметр("ОбъектНастройки", ОбъектНастройки);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекстГиперссылки = СтрЗаменить(НСтр("ru = 'Изменить настройки счетов учета%Детализация% (%КоличествоНастроек%)'"), "%КоличествоНастроек%", Выборка.КоличествоНастроек);
	КонецЕсли;
	ТекстДетализации = НСтр("ru = 'по организациям'");
	Если РазделУчета = Неопределено Тогда
		РазделыУчета = РегистрыСведений.ПорядокОтраженияНаСчетахУчета.РазделыУчетаПоАналитикеУчета(ОбъектНастройки);
		Если РазделыУчета.Количество() Тогда
			РазделУчета = РазделыУчета.Получить(0);
		КонецЕсли;
	КонецЕсли;
	Если РазделУчета <> Неопределено Тогда
		НастройкиМестаУчета = НастройкаСчетовУчетаСервер.НастройкиМестаУчетаПоРазделуУчета(РазделУчета);
		ПредставлениеДетализации = НастройкиМестаУчета.ПредставлениеДетализации;
		Если ЗначениеЗаполнено(ПредставлениеДетализации) Тогда
			ТекстДетализации = ПредставлениеДетализации;
		КонецЕсли;
	КонецЕсли;
	
	ТекстГиперссылки = СтрЗаменить(ТекстГиперссылки, "%Детализация%", " " + ТекстДетализации);
	
	Возврат Новый ФорматированнаяСтрока(ТекстГиперссылки, , ЦветаСтиля.ГиперссылкаЦвет, ,"ОткрытьРабочееМестоНастроекСчетовУчета");
	
КонецФункции

//-- Локализация

Функция СсылкаНовогоЭлементаНастройкиСчетовУчета() Экспорт
	
	Возврат Справочники.НастройкиСчетовУчетаПрочихОпераций.ПолучитьСсылку();
	
КонецФункции

Функция ДанныеНастроекСчетовУчетаПоУмолчанию(СтатьиАктивовПассивов, Знач ДанныеНастройкиСчетовУчета = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Соответствие();
	
	Если ТипЗнч(СтатьиАктивовПассивов) = Тип("Массив") Тогда
		СписокСтатей = СтатьиАктивовПассивов;
	Иначе
		СписокСтатей = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтатьиАктивовПассивов);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("СписокСтатей", СписокСтатей);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СтатьиАктивовПассивов.Ссылка    КАК Ссылка
	//++ Локализация
	|	,
	|	СтатьиАктивовПассивов.СчетУчета КАК СчетУчета,
	|	СтатьиАктивовПассивов.Субконто1 КАК Субконто1,
	|	СтатьиАктивовПассивов.Субконто2 КАК Субконто2,
	|	СтатьиАктивовПассивов.Субконто3 КАК Субконто3
	//-- Локализация

	|ИЗ
	|	ПланВидовХарактеристик.СтатьиАктивовПассивов КАК СтатьиАктивовПассивов
	|ГДЕ
	|	СтатьиАктивовПассивов.Ссылка В (&СписокСтатей)
	|";
	
	Результат = Запрос.Выполнить();
	ВыборкаНастройки = Результат.Выбрать();
	
	Пока ВыборкаНастройки.Следующий() Цикл
		ДанныеНастройки = НастройкаСчетовУчетаКлиентСервер.СоставНастройкиСчетовУчета();
		НастройкаЗаполнена = Ложь;
		//++ Локализация
		Если ЗначениеЗаполнено(ВыборкаНастройки.СчетУчета) Тогда
			ЗаполнитьЗначенияСвойств(ДанныеНастройки, ВыборкаНастройки, НастройкаСчетовУчетаКлиентСервер.РеквизитыНастройкиСчетаУчета());
			НастройкаЗаполнена = Истина;
		КонецЕсли;
		//-- Локализация

		
		Если НастройкаЗаполнена Тогда
			ВозвращаемоеЗначение.Вставить(ВыборкаНастройки.Ссылка,
				Новый Структура("ДанныеНастройки,НастройкаСчетовУчета",
					ДанныеНастройки, СсылкаНовогоЭлементаНастройкиСчетовУчета()));
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция СчетаУчетаУказываютсяВНастройкахПроводок(СтатьяАктивовПассивов) Экспорт
	
	СчетаУчетаВНастройкахПроводок = Ложь;
	
	
	Возврат СчетаУчетаВНастройкахПроводок;
	
КонецФункции

Функция ДоступнаНастройкаСчетовУчета() Экспорт
	
	Возврат НастройкаСчетовУчетаСервер.ДоступнаНастройкаСчетовРеглУчета()
		ИЛИ НастройкаСчетовУчетаСервер.ДоступнаНастройкаСчетовМеждународногоУчета();
	
КонецФункции

#Область НастройкаВыбораСубконто

Функция ОписаниеТипаВсеДокументы() Экспорт
	
	Возврат Документы.ТипВсеСсылки() ;
	
КонецФункции

Функция ОписаниеТиповДоговоров(ТолькоСКонтрагентом = Истина) Экспорт
	
	ТипыДоговоров = Новый Массив;
	ТипыДоговоров.Добавить(Тип("СправочникСсылка.ДоговорыКонтрагентов"));
	ТипыДоговоров.Добавить(Тип("СправочникСсылка.ДоговорыКредитовИДепозитов"));
	ТипыДоговоров.Добавить(Тип("СправочникСсылка.ДоговорыАренды"));
	
	Если НЕ ТолькоСКонтрагентом Тогда
		ТипыДоговоров.Добавить(Тип("СправочникСсылка.ДоговорыМеждуОрганизациями"));
	КонецЕсли;
	
	Возврат Новый ОписаниеТипов(ТипыДоговоров);
	
КонецФункции

Функция ВсеТипыСвязанныхСубконто() Экспорт
	
	СвязанныеСубконто = Новый Соответствие;
	
	УстановитьТипыСвязанныхСубконто(СвязанныеСубконто);
	
	СвязанныеСубконто.Вставить("Организация", НастройкаСчетовУчетаСервер.ТипыСвязанныеСОрганизацией());
	
	Возврат СвязанныеСубконто;
	
КонецФункции

Процедура УстановитьТипыСвязанныхСубконто(СвязанныеСубконто) Экспорт
	
	ТипыСубконто =  ОписаниеТиповДоговоров(Истина);
	ТипыСубконто = Новый ОписаниеТипов(ТипыСубконто, Документы.ТипВсеСсылки().Типы());
	ТипыСубконто = Новый ОписаниеТипов(ТипыСубконто,"СправочникСсылка.БанковскиеСчетаКонтрагентов");
	СвязанныеСубконто.Вставить("Контрагент", ТипыСубконто);
	СвязанныеСубконто.Вставить("Партнер", ТипыСубконто);
	
	ТипыСубконто = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчетаКонтрагентов");
	//++ Локализация
	ТипыСубконто = Новый ОписаниеТипов(ТипыСубконто, "СправочникСсылка.ПартииТМЦВЭксплуатации");
	//-- Локализация
	СвязанныеСубконто.Вставить("ФизическоеЛицо", ТипыСубконто);
	
	ТипыСубконто = Новый ОписаниеТипов(Документы.ТипВсеСсылки().Типы());
	СвязанныеСубконто.Вставить("ПодотчетноеЛицо", ТипыСубконто);
	
	ТипыСубконто = Новый ОписаниеТипов("СправочникСсылка.НомераГТД");
	СвязанныеСубконто.Вставить("СтраныМира", ТипыСубконто);
	
	//++ Локализация
	ТипыСубконто = Новый ОписаниеТипов("СправочникСсылка.ПартииТМЦВЭксплуатации");
	СвязанныеСубконто.Вставить("Номенклатура", ТипыСубконто);
	//-- Локализация
	
	ТипыСубконто = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	СвязанныеСубконто.Вставить("ТипНоменклатуры", ТипыСубконто);
	СвязанныеСубконто.Вставить("ГруппаФинУчетаНоменклатуры", ТипыСубконто);
	СвязанныеСубконто.Вставить("ГруппаАналитическогоУчетаНоменклатуры", ТипыСубконто);
	
КонецПроцедуры

Функция ПолучитьСвойстваСчета(Счет) Экспорт
	
	//++ Локализация
	Если ТипЗнч(Счет) = РеглУчетКлиентСервер.ТипПланСчетов() Тогда
		Возврат БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
	КонецЕсли;
	//-- Локализация
	
	
КонецФункции

#КонецОбласти

// Проверяет является ли переданный счет счетом ИНВ
// 
// Параметры:
//  СчетУчета - см. РеглУчетКлиентСервер.ТипПланСчетов
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоСчетИНВ(СчетУчета) Экспорт
	
	ЭтоСчетИНВ = Ложь;
	
	//++ Локализация
	Если ТипЗнч(СчетУчета) = РеглУчетКлиентСервер.ТипПланСчетов() Тогда
		ЭтоСчетИНВ = ПланыСчетов.Хозрасчетный.ЭтоСчетИНВ(СчетУчета);
	КонецЕсли;
	//-- Локализация
	
	Возврат ЭтоСчетИНВ;
	
КонецФункции

// см. Справочники.Организации.МассивВзаимосвязанныхОрганизаций
// 
// Параметры:
//  Организация - СправочникСсылка.Организации
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.Организации
Функция МассивВзаимосвязанныхОрганизаций(Организация) Экспорт
	
	Возврат Справочники.Организации.МассивВзаимосвязанныхОрганизаций(Организация);
	
КонецФункции

#КонецОбласти
